# TagSubObjectAsPart

## Description
Tag the specified sub-object as part.

```pascal
PROCEDURE TagSubObjectAsPart(
				objectHandle : HANDLE;
				partTypeName : STRING;
				dataID       : LONGINT;
				instanceName : STRING);
```

```python

def vs.TagSubObjectAsPart(objectHandle, partTypeName, dataID, instanceName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHandle|HANDLE|The sub-object handle|
|partTypeName|STRING|The name of the part type.|
|dataID|LONGINT|A numeric value assigned to the part (optional)|
|instanceName|STRING|A unique name for this specific part instance (optional). If specified, the name must be unique for all instances of the part within an object.|

## See Also
VS Functions:
IsObjectTaggedAsPart

## Version
Availability: from Vectorworks 2022
## Category
* Objects - Custom